## `Actividades preliminares`

Comenzamos importando la libreria de pandas

In [23]:
import pandas as pd

Cargamos el dataset que utilizaran durante la investigacion

In [24]:
crime_scene_report     = pd.read_csv("./_src/datasets/Crime Scene report.csv")
drivers_license        = pd.read_csv("./_src/datasets/Drivers license.csv")
facebook_event_checkin = pd.read_csv("./_src/datasets/facebook_event_checkin.csv")
getfitnow_checkin      = pd.read_csv("./_src/datasets/GetFitNow check in.csv")
getfitnow_members      = pd.read_csv("./_src/datasets/GetFitNow members.csv")
income                 = pd.read_csv("./_src/datasets/income.csv")
interview              = pd.read_csv("./_src/datasets/Interviews.csv")
person                 = pd.read_csv("./_src/datasets/Person.csv")

Veamos un poco como estan conformados estos dataframes

In [39]:
# Usamos .info() para ver una descripcion general del dataset, como sus tipos de datos en cada columna y si presenta nulos
person.info()
#Podes cambiar el dataset para ver la informacion general del que quieras

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10011 entries, 0 to 10010
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Id                   10011 non-null  int64
 1   Name                 10011 non-null  object
 2   License_Id           10011 non-null  int64
 3   Address_Number       10011 non-null  int64
 4   Address_Street_Name  10011 non-null  object
 5   Ssn                  10011 non-null  int64
dtypes: int64(4), object(2)
memory usage: 469.4+ KB

In [33]:
crime_scene_pandas = (crime_scene_report['City'] == 'Pandas City') & (crime_scene_report['Type'] == 'murder')

In [35]:
reportes_filtrados = crime_scene_report[crime_scene_pandas]

In [36]:
reportes_filtrados

,Date,Type,Description,City
676,2018-02-15,murder,REDACTED REDACTED REDACTED,Pandas City
677,2018-02-15,murder,Someone killed the guard! He took an arrow to ...,Pandas City
781,2018-01-15,murder,Security footage shows that there were 2 witne...,Pandas City

In [38]:
reportes_filtrados.iloc[2,2]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

### Búsqueda de Annabel

In [41]:
person.head(1)

,Id,Name,License_Id,Address_Number,Address_Street_Name,Ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076

In [84]:
person['primer_nombre'] = person['Name'].str.split().str[0]

In [85]:
Annabel = (person['Address_Street_Name'] == 'Franklin Ave') & (person['primer_nombre'] == 'Annabel')

In [86]:
person_filtrado = person[Annabel]

In [89]:
person_filtrado

,Id,Name,License_Id,Address_Number,Address_Street_Name,Ssn,primer_nombre
665,16371,Annabel Miller,490173,103,Franklin Ave,318771143,Annabel

### Búsqueda testigo 1

In [91]:
tes1 = (person['Address_Street_Name'] == 'Northwestern Dr')

In [92]:
Northwestern_Dr = person[tes1]

In [98]:
Northwestern_Dr.head(3)

,Id,Name,License_Id,Address_Number,Address_Street_Name,Ssn,primer_nombre
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512,Muoi
282,12711,Norman Apolito,667757,599,Northwestern Dr,778264744,Norman
499,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949,Morty

In [96]:
Northwestern_Dr['Address_Number'].max()

4919

### Revisión de entrevistas

In [99]:
interview

      Person_Id                                         Transcript
0         63713                                                NaN
1         33856                                                NaN
2         82799                                                NaN
3         54206                                                NaN
4         34615                                                NaN
...         ...                                                ...
4986      37357  Alice did not wish to offend the Dormouse agai...
4987      10206  time,’ she said, ‘than waste it in asking ridd...
4988      14887  I heard a gunshot and then saw a man run out. ...
4989      16371  I saw the murder happen, and I recognized the ...
4990      67318  I was hired by a woman with a lot of money. I ...

[4991 rows x 2 columns]

### Merge de get_fit_now_member con person

In [105]:
merged_df = pd.merge(getfitnow_members, person, on = 'Name')

In [106]:
merged_df

,Id_x,Person_Id,Name,Membership_Start_Date,Membership_Status,Id_y,License_Id,Address_Number,Address_Street_Name,Ssn,primer_nombre
0,NL318,65076,Everette Koepke,2017-09-26,Gold,65076,919810,1198,Lake Normandy Ave,427618065,Everette
1,0YJ24,80651,Waneta Wellard,2017-12-06,Gold,80651,119490,996,Patricia Way,726208189,Waneta
2,5Y28Y,15218,Millicent Yessios,2018-02-05,Gold,15218,907462,3743,Reaston Blvd,755130400,Millicent
3,A5N3S,24541,Mary Cameron,2017-05-01,Gold,24541,730744,3778,Wollaston St,350805669,Mary
4,R4J4S,13703,Lien Yasin,2017-04-14,Gold,13703,236971,1813,Fitzwarren Blvd,942403927,Lien
...,...,...,...,...,...,...,...,...,...,...,...
179,2111X,36646,Arlie Braig,2017-03-15,Silver,36646,158311,2902,North Ray Circle,903364333,Arlie
180,11ZAK,12107,Agatha Seddon,2017-06-28,Regular,12107,466755,740,Northstead Way,636352179,Agatha
181,HM6U8,50106,Edgar Bamba,2017-01-28,Silver,50106,438149,228,Marble Arch Rd,910274411,Edgar
182,2V137,41693,Wendell Dulany,2017-12-19,Silver,41693,787454,593,E Lake Louise Rd,218829469,Wendell
183,4KB72,79110,Emile Hege,2017-05-22,Regular,79110,642603,1994,Mc Cord Blvd,316775625,Emile

---

## `Comenzamos la investigacion`

### Un crimen ha ocurrido y el detective necesita tu ayuda.

#### Pero antes, veamos un diagrama de esquema para ver como estan conectados todos los dataframes

<img src="./_src/schemeboard.png">


### Te entregaron el informe del lugar del crimen, pero de alguna manera lo perdiste. Recordas vagamente que el crimen fue un ​asesinato​ que ocurrió en algún momento el ​15 de enero de 2018​ y que tuvo lugar en ​Pandas City​. **Te recomiendo comenzar por recuperar el informe correspondiente de su respectivo dataframe**

## Si creen que encontraron al asesino, ejecuten el siguiente codigo con el posible sospechoso

 Por favor, tene en cuenta que es recomendable no acceder al archivo "asesino.py" para evitar revelar detalles importantes de la caso. Si deseas disfrutar plenamente de la experiencia sin spoilers, te sugiero que evites examinar dicho archivo."

In [ ]:
from asesino import solucion
solucion("Colocar aca el nombre del sospechoso")